#include "led.h"

/**************************************************************************
LED接口初始化
**************************************************************************/
void LED_Init(void)
{
RCC->APB2ENR|=1<<3;    //使能 PORTB 时钟  
GPIOB->CRH&=0X0FFFFFFF;//清空设置
GPIOB->CRH|=0X30000000;//PB15 推挽输出
GPIOB->ODR|=1<<15;      //PB15 输出低
}

/**************************************************************************
LED闪烁
**************************************************************************/
void Led_Flash(u16 time)
{           
	  static int last_time,temp;
		   if(temp==0)last_time=time;
	     if(last_time==0)      LED=1;     //时间为0时设置灯状态为灭
       else if(last_time==1) LED=0;     //时间为1时设置灯状态为亮
	     else	if(++temp==last_time)	LED=~LED,temp=0;//其他非0和1的正整数设置灯状态为闪烁
	  
}
